dj-zhou/one-third-hal-stm32/one-third-hal/core/uart-console.c
    consoleInitUartNvic(UART4_IRQn);
}

// ---------------------------------------------------------------------------
void UART4_IRQHandler(void) {
#if defined(STM32F107xC)
    ConsoleUartIRQ();
#else
#error UART4_IRQHandler(): need to implement and verify!
#endif
}
#endif  // CONSOLE_USE_UART4 && UART4_EXISTS

// ============================================================================
#if defined(CONSOLE_USE_UART5) && defined(UART5_EXISTS)
// ---------------------------------------------------------------------------
// UART5 test on PC12 (TX) & PD2 (RX)
// supported baud rate: 115200, 230400, 460800, 576000, 921600
static void InitUART5_PC12PD2(void) {
#if defined(STM32F107xC)
    ConsoleInitUartPins(GPIOC, 12, GPIOD, 2);  // verified
#else
#error InitUART5_PC12PD2(): need to implement and verify!
#endif

    consoleInitUartNvic(UART5_IRQn);
}

// ---------------------------------------------------------------------------
void UART5_IRQHandler(void) {
#if defined(STM32F107xC)
    ConsoleUartIRQ();
#else
#error UART5_IRQHandler(): need to implement and verify!
#endif
}
#endif  // CONSOLE_USE_UART5 && UART5_EXISTS

// ============================================================================
#if defined(CONSOLE_USE_UART7) && defined(UART7_EXISTS)
static void InitUART7_PE8PE7(void) {
#if defined(STM32F427xx)
    ConsoleInitUartPins(GPIOE, 8, GPIOE, 7, GPIO_AF8_UART7);  // verified
#else
#error InitUART7_PE8PE7(): need to implement and verify!
#endif

    consoleInitUartNvic(UART7_IRQn);
}

// ---------------------------------------------------------------------------
void UART7_IRQHandler(void) {
#if defined(STM32F427xx)
    ConsoleUartIRQ();
#else
#error UART7_IRQHandler(): need to implement and verify!
#endif
}
#endif  // CONSOLE_USE_UART7 && UART7_EXISTS

// ============================================================================
extern void ConsolePrintf(char* sign_data, char* format, va_list ap);

// ============================================================================
static void oneThirdPrintk(LogLevel_e level, char* format, ...) {
    if (level <= console.level) {
        char sign_data[_CONSOLE_SIGN_DATA_SIZE];
        va_list ap;
        va_start(ap, format);
        ConsolePrintf(sign_data, format, ap);
        va_end(ap);
    }
}

// ============================================================================
static void oneThirdPrintf(char* format, ...) {
    if (LOG_INFO <= console.level) {
        char sign_data[_CONSOLE_SIGN_DATA_SIZE];
        va_list ap;
        va_start(ap, format);
        ConsolePrintf(sign_data, format, ap);
        va_end(ap);
    }
}

// ============================================================================
static void consoleError(char* format, ...) {
    if (LOG_INFO <= console.level) {
        char sign_data[_CONSOLE_SIGN_DATA_SIZE];
        va_list ap;
        va_start(ap, format);
        while (1) {
            ConsolePrintf(sign_data, format, ap);
            // just some delay
            for (int i = 0; i < 3000; i++) {
                for (int j = 0; j < 3000; j++) {
                    ;
                }
            }
        }
        va_end(ap);
    }
}

// ============================================================================
static char consoleGetChar(uint16_t time) {
    char read_char;
    do {
        if (rb.r_ptr != rb.w_ptr) {
            read_char = *rb.r_ptr;
            if (++rb.r_ptr == (rb.buffer + _CONSOLE_BUFF_LEN)) {
                rb.r_ptr = rb.buffer;
            }
            return read_char;
        }
    } while (time-- != 0);

    return 0;
}

// ============================================================================
static void consoleSetLevel(LogLevel_e l) {
    console.level = l;
}

// ============================================================================
static void ConsoleSetChar(uint8_t* buf, uint32_t len) {
    do {
        if (rb.w_ptr >= rb.r_ptr) {
            if (rb.w_ptr + len <= (rb.buffer + _CONSOLE_BUFF_LEN)) {
                strncpy(rb.w_ptr, ( char* )buf, ( uint16_t )len);
                rb.w_ptr = rb.w_ptr + len;
                buf = buf + len;
                len = 0;
                if (rb.w_ptr == (rb.buffer + _CONSOLE_BUFF_LEN)) {
                    rb.w_ptr = rb.buffer;
                }
            }
            else {
                strncpy(rb.w_ptr, ( char* )buf,
                        (uint16_t)((rb.buffer + _CONSOLE_BUFF_LEN) - rb.w_ptr));
                buf = buf + (rb.buffer + _CONSOLE_BUFF_LEN - rb.w_ptr);
                len = len - (rb.buffer + _CONSOLE_BUFF_LEN - rb.w_ptr);
                rb.w_ptr = rb.buffer;
            }
        }
        else {
            if (((rb.r_ptr - 1) - rb.w_ptr) >= len) {
                strncpy(rb.w_ptr, ( char* )buf, ( uint16_t )len);
                buf = buf + len;
                rb.w_ptr = rb.w_ptr + len;
                len = 0;
            }
            else {
                strncpy(rb.w_ptr, ( char* )buf,
                        (uint16_t)((rb.r_ptr - 1) - rb.w_ptr));
                buf = buf + ((rb.r_ptr - 1) - rb.w_ptr);
                len = 0;
                rb.w_ptr = rb.r_ptr - 1;
            }
        }
    } while (len != 0);
}

// ============================================================================
static uint8_t cli_cmd_num_ = 0;
static void CliAttachCmd(char* str, CliHandle p) {
    if (cli_cmd_num_ < _CLI_CMD_MAX_NUM - 1) {
        cmd_[cli_cmd_num_].str = str;
        cmd_[cli_cmd_num_].p = p;
        cli_cmd_num_++;
    }
    else {
        console.error(
            "Too many cli commands were registered. \r\nYou can "
            "increase it by defining _CLI_CMD_MAX_NUM in config.h\r\n");
    }
}

// ============================================================================
// HAL_StatusTypeDef CliSuspend( int argc, char** argv );
// -----------------------------
static void consoleConfig(uint32_t baud_rate) {

    console.level = LOG_INFO;
    rb.r_ptr = rb.buffer;
    rb.w_ptr = rb.buffer;

#if defined(_CONSOLE_USE_USART1_PA9PA10)
    // g_config_uart_used |= 1 << 1;
    InitUSART1_PA9PA10();
    hconsole_.Instance = USART1;
#elif defined(_CONSOLE_USE_USART1_PB6PB7)
    // g_config_uart_used |= 1 << 1;
    InitUSART1_PB6PB7();
    hconsole_.Instance = USART1;
#elif defined(_CONSOLE_USE_USART2_PA2PA3)
    // g_config_uart_used |= 1 << 2;
    InitUSART2_PA2PA3();
    hconsole_.Instance = USART2;
#elif defined(_CONSOLE_USE_USART2_PD5PD6)
    // g_config_uart_used |= 1 << 2;
    InitUSART2_PD5PD6();
    hconsole_.Instance = USART2;
#elif defined(_CONSOLE_USE_USART3_PB10PB11)
    // g_config_uart_used |= 1 << 3;
    InitUSART3_PB10PB11();
    hconsole_.Instance = USART3;
#elif defined(_CONSOLE_USE_USART3_PC10PC11)
    // g_config_uart_used |= 1 << 3;
    InitUSART3_PC10PC11();
    hconsole_.Instance = USART3;
#elif defined(_CONSOLE_USE_USART3_PD8PD9)
    // g_config_uart_used |= 1 << 3;
    InitUSART3_PD8PD9();
    hconsole_.Instance = USART3;
#elif defined(_CONSOLE_USE_UART4_PC10PC11)
    // g_config_uart_used |= 1 << 4;
    InitUART4_PC10PC11();
    hconsole_.Instance = UART4;
#elif defined(_CONSOLE_USE_UART5_PC12PD2)
    // g_config_uart_used |= 1 << 5;
    InitUART5_PC12PD2();
    hconsole_.Instance = UART5;
#elif defined(_CONSOLE_USE_UART7_PE8PE7)
    // g_config_uart_used |= 1 << 7;
    InitUART7_PE8PE7();
    hconsole_.Instance = UART7;
#else
#error consoleConfig(): not implemented!
#endif
    // usart setting -------------
    utils.clock.enableUart(hconsole_.Instance);
    ConsoleInitUartSettings(hconsole_.Instance, baud_rate, 8, 'n', 1);
    __HAL_UART_ENABLE(&hconsole_);

    // command line interface -------------
    memset(&cli_, '\0', sizeof(cli_));
    memset(cmd_, '\0', sizeof(cmd_[100]));
    cli_.out_message = "\r\n" CYN _CLI_OUT_MESSAGE NOC ": ";
    CliDeInit();

    // register some default commands -------------
    CliAttachCmd("help", ( CliHandle )CliShowCmd);
    CliAttachCmd("system &cmd", ( CliHandle )CliSystem);
    CliAttachCmd("log &level", ( CliHandle )CliLogSetLevel);
    CliAttachCmd("scheduler &cmd", ( CliHandle )CliShowScheduler);

#if defined(_STIME_USE_SCHEDULER)
    CliAttachCmd("cli-suspend &seconds", ( CliHandle )CliSuspend);
#endif

