dj-zhou/one-third-hal-stm32/one-third-hal/core/uart-console.c
    console.rx.enable(true);
}

// ============================================================================
static void consoleTxMode(UartTx_e tx) {
    GPIO_InitTypeDef GPIO_InitStructure;
    if (tx == TX_PP) {
        GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
    }
    else if (tx == TX_OD) {
        GPIO_InitStructure.Mode = GPIO_MODE_AF_OD;
    }
    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_HIGH;
#if defined(_CONSOLE_USE_USART1_PA9PA10)
    GPIO_InitStructure.Pin = GPIO_PIN_9;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStructure);
#elif defined(_CONSOLE_USE_USART1_PB6PB7)
    GPIO_InitStructure.Pin = GPIO_PIN_6;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStructure);
#elif defined(_CONSOLE_USE_USART2_PA2PA3)
    GPIO_InitStructure.Pin = GPIO_PIN_2;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStructure);
#elif defined(_CONSOLE_USE_USART2_PD5PD6)
    GPIO_InitStructure.Pin = GPIO_PIN_5;
    HAL_GPIO_Init(GPIOD, &GPIO_InitStructure);
#elif defined(_CONSOLE_USE_USART3_PB10PB11)
    GPIO_InitStructure.Pin = GPIO_PIN_10;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStructure);
#elif defined(_CONSOLE_USE_USART3_PC10PC11)
    GPIO_InitStructure.Pin = GPIO_PIN_10;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);
#elif defined(_CONSOLE_USE_USART3_PD8PD9)
    GPIO_InitStructure.Pin = GPIO_PIN_8;
    HAL_GPIO_Init(GPIOD, &GPIO_InitStructure);
#elif defined(_CONSOLE_USE_UART4_PC10PC11)
    GPIO_InitStructure.Pin = GPIO_PIN_10;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);
#elif defined(_CONSOLE_USE_UART5_PC12PD2)
    GPIO_InitStructure.Pin = GPIO_PIN_12;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);
#elif defined(_CONSOLE_USE_UART7_PE8PE7)
    GPIO_InitStructure.Pin = GPIO_PIN_8;
    HAL_GPIO_Init(GPIOE, &GPIO_InitStructure);
#else
#error console_TX_Mode(): not implemented!
#endif
}

// ============================================================================
static void consoleEnableRxen(bool enable) {
    if (enable) {
        __HAL_UART_ENABLE_IT(&hconsole_, UART_IT_RXNE);
    }
    else {
        __HAL_UART_DISABLE_IT(&hconsole_, UART_IT_RXNE);
    }
}

// ============================================================================
static void consoleSetRxStatus(bool v) {
    console_rx_enabled_ = v;
}

// ============================================================================
static bool consoleGetRxStatus(void) {
    return console_rx_enabled_;
}

// ============================================================================
// some values:
// \n: 0d10
// \r: 0d13
// keys:
// ENTER    : 0d13 (0x0D)
// ESC      : 0d27 (0x1B)
// Tab      : 0d09 (0x09)
// backspace: 0d127 (0x7F)
// space    : 0d32 (0x20)

// 0x1B then 0x5B:
// up arrow: 0d27, then 0d91 (0x1B, then 0x5B)
// down arrow: 0d27, then 0d91 (0x1B, then 0x5B), why it is the same as up
//             arrow?
// left/right arrows: the same
// home, end, page up, page down, delete

static void CliProcess(void) {
    char read_char;
    static uint8_t label = 0;

    while ((read_char = console.read(0)) != 0) {
        if (read_char == '\n' || read_char == '\r') {
            label = 0;
            if ((cli_.cmd_buff == cli_.cmd_buff_tail)
                || (cli_.cmd_buff[0] == ' ')) {
                ;  // just do nothing
            }
            else {
                if (*(--cli_.cmd_buff_tail) == ' ') {
                    *cli_.cmd_buff_tail = '\0';
                }
                CliProcessCmd(cli_.cmd_buff);
                CliDeInit();
            }
            console.write.str(cli_.out_message);
        }
        else {
            if (read_char == 0x09) {
                CliTabCompletion(console.read(0xffff));
            }
            // 0x7F is the key value of backspace on Linux
            else if (read_char == 0x7F) {
                CliBackspace();
            }
            else if ((read_char >= '\b') && (read_char < ' ')) {
                label = 0;

                if (read_char == 0x1b && console.read(0xffff) == 0x5b) {
                    CliDirection(console.read(0xffff));
                }
            }
            else if ((read_char >= ' ') && (read_char <= '~')) {
                if (read_char == '#' || label == 1) {
                    label = true;
                }
                else if ((cli_.cmd_buff_tail - cli_.cmd_buff)
                         < (_CLI_CMD_MAX_LEN - 1)) {
                    CliInput(read_char);
                }
            }
        }
    }
}

// ============================================================================
// clang-format off
Console_t console = {
    .level        = LOG_INFO          ,
    .config       = consoleConfig     ,
    .tx.mode      = consoleTxMode     ,
    .rx.enable    = consoleEnableRxen ,
    .rx.get       = NULL              ,
    .rx.setStatus = consoleSetRxStatus,
    .rx.getStatus = consoleGetRxStatus,
    .printk       = oneThirdPrintk    ,
    .printf       = oneThirdPrintf    ,
    .error        = consoleError      ,
    .write.byte   = consoleWriteByte  ,
    .write.str    = consoleWriteStr   ,
    .read         = consoleGetChar    ,

    // cli related
    .cli.setLevel = consoleSetLevel,
    .cli.attach   = CliAttachCmd   ,
    .cli.process  = CliProcess     ,
};
// clang-format on

#endif  //  CONSOLE_IS_USED
